In [4]:
import pandas as pd
path="C:/Users/ragha/Downloads/analysis/earthquake_data_tsunami.csv"
df=pd.read_csv(path)
print(df)

     magnitude  cdi  mmi  sig  nst   dmin   gap    depth  latitude  longitude  \
0          7.0    8    7  768  117  0.509  17.0   14.000   -9.7963    159.596
1          6.9    4    4  735   99  2.229  34.0   25.000   -4.9559    100.738
2          7.0    3    3  755  147  3.125  18.0  579.000  -20.0508   -178.346
3          7.3    5    5  833  149  1.865  21.0   37.000  -19.2918   -172.129
4          6.6    0    2  670  131  4.998  27.0  624.464  -25.5948    178.278
..         ...  ...  ...  ...  ...    ...   ...      ...       ...        ...
777        7.7    0    8  912  427  0.000   0.0   60.000   13.0490    -88.660
778        6.9    5    7  745    0  0.000   0.0   36.400   56.7744   -153.281
779        7.1    0    7  776  372  0.000   0.0  103.000  -14.9280    167.170
780        6.8    0    5  711   64  0.000   0.0   33.000    6.6310    126.899
781        7.5    0    7  865  324  0.000   0.0   33.000    6.8980    126.579

     Year  Month  tsunami
0    2022     11        1
1    2022     11        0
2    2022     11        1
3    2022     11        1
4    2022     11        1
..    ...    ...      ...
777  2001      1        0
778  2001      1        0
779  2001      1        0
780  2001      1        0
781  2001      1        0

[782 rows x 13 columns]

In [8]:
df.head() #for first 5 rows

,magnitude,cdi,mmi,sig,nst,dmin,gap,depth,latitude,longitude,Year,Month,tsunami
0,7.0,8,7,768,117,0.509,17.0,14.000,-9.7963,159.596,2022,11,1
1,6.9,4,4,735,99,2.229,34.0,25.000,-4.9559,100.738,2022,11,0
2,7.0,3,3,755,147,3.125,18.0,579.000,-20.0508,-178.346,2022,11,1
3,7.3,5,5,833,149,1.865,21.0,37.000,-19.2918,-172.129,2022,11,1
4,6.6,0,2,670,131,4.998,27.0,624.464,-25.5948,178.278,2022,11,1

In [9]:
df.tail()  # for last  rows

,magnitude,cdi,mmi,sig,nst,dmin,gap,depth,latitude,longitude,Year,Month,tsunami
777,7.7,0,8,912,427,0.0,0.0,60.0,13.0490,-88.660,2001,1,0
778,6.9,5,7,745,0,0.0,0.0,36.4,56.7744,-153.281,2001,1,0
779,7.1,0,7,776,372,0.0,0.0,103.0,-14.9280,167.170,2001,1,0
780,6.8,0,5,711,64,0.0,0.0,33.0,6.6310,126.899,2001,1,0
781,7.5,0,7,865,324,0.0,0.0,33.0,6.8980,126.579,2001,1,0

In [10]:
df.to_csv(path)  # this is to save the file

In [11]:
df.dtypes # to view the data type  used in the file

magnitude    float64
cdi            int64
mmi            int64
sig            int64
nst            int64
dmin         float64
gap          float64
depth        float64
latitude     float64
longitude    float64
Year           int64
Month          int64
tsunami        int64
dtype: object

In [12]:
df.describe() # gve the statistical memory

,magnitude,cdi,mmi,sig,nst,dmin,gap,depth,latitude,longitude,Year,Month,tsunami
count,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000
mean,6.941125,4.333760,5.964194,870.108696,230.250639,1.325757,25.038990,75.883199,3.538100,52.609199,2012.280051,6.563939,0.388747
std,0.445514,3.169939,1.462724,322.465367,250.188177,2.218805,24.225067,137.277078,27.303429,117.898886,6.099439,3.507866,0.487778
min,6.500000,0.000000,1.000000,650.000000,0.000000,0.000000,0.000000,2.700000,-61.848400,-179.968000,2001.000000,1.000000,0.000000
25%,6.600000,0.000000,5.000000,691.000000,0.000000,0.000000,14.625000,14.000000,-14.595600,-71.668050,2007.000000,3.250000,0.000000
50%,6.800000,5.000000,6.000000,754.000000,140.000000,0.000000,20.000000,26.295000,-2.572500,109.426000,2013.000000,7.000000,0.000000
75%,7.100000,7.000000,7.000000,909.750000,445.000000,1.863000,30.000000,49.750000,24.654500,148.941000,2017.000000,10.000000,1.000000
max,9.100000,9.000000,9.000000,2910.000000,934.000000,17.654000,239.000000,670.810000,71.631200,179.662000,2022.000000,12.000000,1.000000

In [14]:
df.describe(include="all")

,magnitude,cdi,mmi,sig,nst,dmin,gap,depth,latitude,longitude,Year,Month,tsunami
count,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000,782.000000
mean,6.941125,4.333760,5.964194,870.108696,230.250639,1.325757,25.038990,75.883199,3.538100,52.609199,2012.280051,6.563939,0.388747
std,0.445514,3.169939,1.462724,322.465367,250.188177,2.218805,24.225067,137.277078,27.303429,117.898886,6.099439,3.507866,0.487778
min,6.500000,0.000000,1.000000,650.000000,0.000000,0.000000,0.000000,2.700000,-61.848400,-179.968000,2001.000000,1.000000,0.000000
25%,6.600000,0.000000,5.000000,691.000000,0.000000,0.000000,14.625000,14.000000,-14.595600,-71.668050,2007.000000,3.250000,0.000000
50%,6.800000,5.000000,6.000000,754.000000,140.000000,0.000000,20.000000,26.295000,-2.572500,109.426000,2013.000000,7.000000,0.000000
75%,7.100000,7.000000,7.000000,909.750000,445.000000,1.863000,30.000000,49.750000,24.654500,148.941000,2017.000000,10.000000,1.000000
max,9.100000,9.000000,9.000000,2910.000000,934.000000,17.654000,239.000000,670.810000,71.631200,179.662000,2022.000000,12.000000,1.000000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   magnitude  782 non-null    float64
 1   cdi        782 non-null    int64
 2   mmi        782 non-null    int64
 3   sig        782 non-null    int64
 4   nst        782 non-null    int64
 5   dmin       782 non-null    float64
 6   gap        782 non-null    float64
 7   depth      782 non-null    float64
 8   latitude   782 non-null    float64
 9   longitude  782 non-null    float64
 10  Year       782 non-null    int64
 11  Month      782 non-null    int64
 12  tsunami    782 non-null    int64
dtypes: float64(6), int64(7)
memory usage: 79.6 KB

In [18]:
df.columns # provide the columns

Index(['magnitude', 'cdi', 'mmi', 'sig', 'nst', 'dmin', 'gap', 'depth',
       'latitude', 'longitude', 'Year', 'Month', 'tsunami'],
      dtype='object')

In [43]:
import pandas as pd
path="C:/Users/ragha/Downloads/analysis/employee.xlsx"
df=pd.read_excel(path) # importing excel file
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [44]:
df.head()

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090

In [30]:
df.tail()

   ID     Name  Age  Salary                Email   Mobile No
0   1    Ragav   24   55000    ragav@example.com  9876543210
1   2   Kushal   25   60000   kushal@example.com  8765432109
2   3  Sandeep   26   52000  sandeep@example.com  9988776655
3   4     Guru   27   58000     guru@example.com  9123456780
4   5   Chirag   23   50000   chirag@example.com  9090909090

In [31]:
df.dtypes

ID            int64
Name         object
Age           int64
Salary        int64
Email        object
Mobile No     int64
dtype: object

In [35]:
df.describe()

             ID        Age        Salary     Mobile No
count  5.000000   5.000000      5.000000  5.000000e+00
mean   3.000000  25.000000  55000.000000  9.369024e+09
std    1.581139   1.581139   4123.105626  5.347063e+08
min    1.000000  23.000000  50000.000000  8.765432e+09
25%    2.000000  24.000000  52000.000000  9.090909e+09
50%    3.000000  25.000000  55000.000000  9.123457e+09
75%    4.000000  26.000000  58000.000000  9.876543e+09
max    5.000000  27.000000  60000.000000  9.988777e+09

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         5 non-null      int64
 1   Name       5 non-null      object
 2   Age        5 non-null      int64
 3   Salary     5 non-null      int64
 4   Email      5 non-null      object
 5   Mobile No  5 non-null      int64
dtypes: int64(4), object(2)
memory usage: 372.0+ bytes

In [34]:
df.head(5)

   ID     Name  Age  Salary                Email   Mobile No
0   1    Ragav   24   55000    ragav@example.com  9876543210
1   2   Kushal   25   60000   kushal@example.com  8765432109
2   3  Sandeep   26   52000  sandeep@example.com  9988776655
3   4     Guru   27   58000     guru@example.com  9123456780
4   5   Chirag   23   50000   chirag@example.com  9090909090

In [36]:
headers=["card","emp_name","emp_age","emp_salary","em_email","emp_mob"]
df.columns=headers
df.head()

   card emp_name  emp_age  emp_salary             em_email     emp_mob
0     1    Ragav       24       55000    ragav@example.com  9876543210
1     2   Kushal       25       60000   kushal@example.com  8765432109
2     3  Sandeep       26       52000  sandeep@example.com  9988776655
3     4     Guru       27       58000     guru@example.com  9123456780
4     5   Chirag       23       50000   chirag@example.com  9090909090

In [37]:
df["emp_age"]=df["emp_age"]+1
df.head()

   card emp_name  emp_age  emp_salary             em_email     emp_mob
0     1    Ragav       25       55000    ragav@example.com  9876543210
1     2   Kushal       26       60000   kushal@example.com  8765432109
2     3  Sandeep       27       52000  sandeep@example.com  9988776655
3     4     Guru       28       58000     guru@example.com  9123456780
4     5   Chirag       24       50000   chirag@example.com  9090909090

In [38]:
print(df)

   card emp_name  emp_age  emp_salary             em_email     emp_mob
0     1    Ragav       25       55000    ragav@example.com  9876543210
1     2   Kushal       26       60000   kushal@example.com  8765432109
2     3  Sandeep       27       52000  sandeep@example.com  9988776655
3     4     Guru       28       58000     guru@example.com  9123456780
4     5   Chirag       24       50000   chirag@example.com  9090909090

In [39]:
df["emp_age"]=df["emp_age"]-1
df.head()

   card emp_name  emp_age  emp_salary             em_email     emp_mob
0     1    Ragav       24       55000    ragav@example.com  9876543210
1     2   Kushal       25       60000   kushal@example.com  8765432109
2     3  Sandeep       26       52000  sandeep@example.com  9988776655
3     4     Guru       27       58000     guru@example.com  9123456780
4     5   Chirag       23       50000   chirag@example.com  9090909090

In [40]:
print(df)

   card emp_name  emp_age  emp_salary             em_email     emp_mob
0     1    Ragav       24       55000    ragav@example.com  9876543210
1     2   Kushal       25       60000   kushal@example.com  8765432109
2     3  Sandeep       26       52000  sandeep@example.com  9988776655
3     4     Guru       27       58000     guru@example.com  9123456780
4     5   Chirag       23       50000   chirag@example.com  9090909090

In [45]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [49]:
  df.head()

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090

In [50]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [52]:
df.drop([5],axis=0)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090

In [53]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [56]:
df.dropna()

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090

In [61]:
df.drop(columns=["Name"],axis=1).drop([4],axis=0)  #  to drop specific row with column

   ID   Age  Salary                Email   Mobile No
0   1  24.0   55000    ragav@example.com  9876543210
1   2  25.0   60000   kushal@example.com  8765432109
2   3  26.0   52000  sandeep@example.com  9988776655
3   4  27.0   58000     guru@example.com  9123456780
5   6   NaN   20000                  NaN  8584839594

In [62]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [67]:
df.dropna(subset=["Age"],axis=0)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090

   ID   Age  Salary                Email   Mobile No
0   1  24.0   55000    ragav@example.com  9876543210
1   2  25.0   60000   kushal@example.com  8765432109
2   3  26.0   52000  sandeep@example.com  9988776655
3   4  27.0   58000     guru@example.com  9123456780
5   6   NaN   20000                  NaN  8584839594

In [71]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [73]:
import numpy as np
df["Age"].replace(np.nan,22)

0    24.0
1    25.0
2    26.0
3    27.0
4    23.0
5    22.0
Name: Age, dtype: float64

In [75]:
df.head()

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090

In [76]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  24.0   55000    ragav@example.com  9876543210
1   2   Kushal  25.0   60000   kushal@example.com  8765432109
2   3  Sandeep  26.0   52000  sandeep@example.com  9988776655
3   4     Guru  27.0   58000     guru@example.com  9123456780
4   5   Chirag  23.0   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [79]:
df["Age"]=df["Age"]/2

In [80]:
df.head()

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090

In [82]:
df.rename(columns={"Age":"Emp_age"})

   ID     Name  Emp_age  Salary                Email   Mobile No
0   1    Ragav     6.00   55000    ragav@example.com  9876543210
1   2   Kushal     6.25   60000   kushal@example.com  8765432109
2   3  Sandeep     6.50   52000  sandeep@example.com  9988776655
3   4     Guru     6.75   58000     guru@example.com  9123456780
4   5   Chirag     5.75   50000   chirag@example.com  9090909090
5   6    kumar      NaN   20000                  NaN  8584839594

In [83]:
df.dtypes

ID             int64
Name          object
Age          float64
Salary         int64
Email         object
Mobile No      int64
dtype: object

In [84]:
df.drop([5],axis=0)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090

In [85]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [86]:
df.drop([5],axis=0)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090

In [87]:
df.rename(columns={"Emp_age":"Age"})

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [88]:
df.dtypes

ID             int64
Name          object
Age          float64
Salary         int64
Email         object
Mobile No      int64
dtype: object

In [104]:
df.drop([5],axis=0)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090

In [102]:
df.head(5)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090

In [105]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090
5   6    kumar   NaN   20000                  NaN  8584839594

In [109]:
df.dropna(inplace=True)

In [111]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090

In [112]:
df["Age"].astype("int")

0    6
1    6
2    6
3    6
4    5
Name: Age, dtype: int64

In [113]:
print(df)

   ID     Name   Age  Salary                Email   Mobile No
0   1    Ragav  6.00   55000    ragav@example.com  9876543210
1   2   Kushal  6.25   60000   kushal@example.com  8765432109
2   3  Sandeep  6.50   52000  sandeep@example.com  9988776655
3   4     Guru  6.75   58000     guru@example.com  9123456780
4   5   Chirag  5.75   50000   chirag@example.com  9090909090

In [114]:
df["Age"]=df["Age"].astype("int")

In [115]:
print(df)

   ID     Name  Age  Salary                Email   Mobile No
0   1    Ragav    6   55000    ragav@example.com  9876543210
1   2   Kushal    6   60000   kushal@example.com  8765432109
2   3  Sandeep    6   52000  sandeep@example.com  9988776655
3   4     Guru    6   58000     guru@example.com  9123456780
4   5   Chirag    5   50000   chirag@example.com  9090909090